[
    {
        "name": "Boxcar Social",
        "location": "235 Queens Quay W, Toronto, ON M5J 2G8",
        "entry": "Loud and boisterous in the evenings, quaint and sweet during the day. Love it. They got your standard beverages, all of which are quite tasty. I tried a pour-over at the Temperance location that was an absolute delight. I’m big on their mochas and London fogs. Also good for a nice Americano.\nOne of the biggest shops in the city, rivaling Dark Horse Espresso on Spadina. Plenty of room for you and yer buds. Also a decent selection of food. Had a steak tartare there once and it was great. Perhaps I’m uncultured swine because when I ordered it I didn’t know what tartare even was, but I thought it was quite delicious. Their smoked salmon on toast is also really nice if you stop by during the day. Just note that the food is a bit pricey, as well as the drinks, in my opinion. I’m probably gonna contradict myself a million times on this website as to what is pricey and what isn’t… Bear with me.\nI helped my wife get a job here once. Thanks Tianna, you’re a real one. She was leaving her current position and was able to hot potato to my wife. Dope. Stay in touch with your friends from school, dear reader.\nTurbo bonus: SKATING IN THE WINTER. I’m a tall, lanky, out of shape Arab man who has no business on ice but one day dreams of being able to do the ice hockeys. I take whatever opportunities I can do to some knife sliding. The Natrel public rink is directly in front of the Harbourfront Boxcar Social location. Warm beverages and skating. Not much of a better winter duo.\nThis place is great for people/boat/plane watching in the big windows. Take your time here, it’s snug."
    },
    {
        "name": "Versus Coffee",
        "location": "70 Adelaide St E, Toronto, ON M5C 2R6",
        "entry": "One of the more darling coffee shops I’ve been to. Very smol. Lovely bright aesthetic, with a nice patio for the warmer months. I came here during the dead of winter though, so none of that for me. I’ve only been here once, and had a wonderful London fog. The huge windows make this place great for reading and for Instagram selfies if you’re into that. Speaking of taking pictures of everything, you might’ve heard of this place because of their rainbow lattes, wowowowow. They’re known for doing fun colourful art in their bevvies. Doesn’t taste any different but hey it’s NEAT.\nNot much seating here on the inside, but it wasn’t particularly crowded when I went on a Saturday afternoon in the winter. Your mileage may vary. Snow isn’t fun to move through, that might explain the busyness. Come here for a nice chat, a warm drink, or with a good book. There’s a theme with these posts. Most shops are good for the aforementioned. Or bring a laptop and get some work done! Just don’t buy a single shot of espresso then sit there for eight hours. Or do, I’m not your mom. I just think it’s not very nice."
    },
    {
        "name": "ODIN",
        "location": "514 King St E, Toronto, ON M5A 1M1",
        "entry": "Intriguing modern aesthetic, high ceilings, big windows, ANGLES, greens, and quite a bit of seating. Decent crowd when I went on a Saturday afternoon. As with any super bright shop, this a good stop for some reading. Then you can keep walking to Riverdale park, or something. I got a matcha latte and a chicken sandwich. Both hit the spot. I especially recommend the matcha latte to those who enjoy the taste of grass and earth, which I do. Yum yum soil. Louisa got an almond milk latte that she quite enjoyed as well. \nOverall this place is a good time. I’d love to go back, it’s just a bit of a stroll from where we are. Reminds me of the Settlement Co in Kitchener on King and Victoria. Grab a buncha friends and hang out for a while then take a stroll down to the Distillery District for whatever thing is probably happening."
    }
]